# Класс Area
Модуль 1. Занятие 3

Реализуйте класс Area, в котором есть три перегруженных статических метода getArea(), которые возвращают double, для вычисления площади следующих геометрических фигур:
* круг(double radius);
* прямоугольник(int width, int length);
* цилиндр(double radius, double height) - полная площадь поверхности цилиндра.

Значения округлить до 2-х знаков после запятой. Если вычислить невозможно, то вернуть 0.

## Примеры

### Входные данные
```
System.out.printf("%6.2f\n", Area.getArea(10.0));
System.out.printf("%6.2f\n", Area.getArea(15, 25));
System.out.printf("%6.2f\n", Area.getArea(12.0, 17.0));
```
### Результат работы
```
314.16
375.00
2186.54
```

## P.S.
Число Pi взять из библиотеки Math: